//
//  TermsModel.swift
//  Offroad-iOS
//
//  Created by 조혜린 on 8/28/24.
//

struct TermsListModel {
    let isRequired: Bool
    let titleString: String
    var isSelected: Bool
}

struct TermsDetailModel {
    let titleString: String
    let descriptionString: String
    let contentString: String
}

extension TermsListModel {
    static func getTermsListModel() -> [TermsListModel] {
        return [
            TermsListModel(isRequired: true, titleString: "서비스 이용약관", isSelected: false),
            TermsListModel(isRequired: true, titleString: "개인정보수집/이용 동의", isSelected: false),
            TermsListModel(isRequired: true, titleString: "위치기반 서비스 이용약관", isSelected: false),
            TermsListModel(isRequired: false, titleString: "마케팅 정보 수신 동의", isSelected: false)
        ]
    }
}

extension TermsDetailModel {
    static func getTermsDetailModel() -> [TermsDetailModel] {
        return [
            TermsDetailModel(
                titleString: "서비스 이용약관",
                descriptionString: "서비스 제공 및 이용과 관련하여 오프로드가 취득한 개인정보는 “개인정보보호법” 및 “정보통신망 이용촉진 및 정보보호 등에 관한 법률” 등 정보통신서비스제공자가 준수하여야 할 관련 법령상의 개인정보 보호 규정을 준수합니다.",
                contentString: """
1. 고객이 수집 및 이용에 동의한 개인정보를 활용하여, 전자적 전송 매체(E-mail)를 통하여 발송됩니다.
2. 발송되는 마케팅 정보는 수신자에게 오프로드 및 제 3자의 상품 또는 서비스에 대한 혜택 정보, 각종 이벤트 정보, 개인 맞춤형 광고 정보 등 광고성 정보로 관련 법의 규정을 준수하여 발송됩니다. 단, 광고성 정보 이외에 의무적으로 안내되어야 하는 정보성 내용은 수신동의 여부와 무관하게 제공됩니다.
3. 마케팅 정보 수신 여부 및 마케팅을 위한 개인정보 수집이용을 거부하실 수 있으며, 거부 시에도 Track 1 서비스를 이용하실 수 있으나, 동의를 거부한 경우 각종 소식 및 이벤트 참여에 제한이 있을 수 있습니다.
4. 수신동의를 받은 날부터 2년마다 (매 2년이 되는 해의 수신동의를 받은 날과 같은 날 전까지를 말한다.) 해당 수신자의 수신동의 여부를 확인합니다.
5. Track 1 고객센터를 통해 수신동의를 철회할 수 있습니다.
※ 문의 및 동의 철회: dlrmsdnjs555@naver.com
 ∙ 개인정보 수집항목: 이메일, 닉네임
 ∙ 개인정보 수집 이용 목적: 이벤트 운영 및 광고성 정보 전송, 서비스 관련 정보 전송
 ∙ 보유 및 이용기간: 이용자가 동의를 철회하거나, 탈퇴 시까지(마케팅 수신동의 여부 2년 주기로 확인). 단, 관련 법령 규정에 따라 보존할 필요가 있을 경우, 해당 기간까지 보존함.
"""
            ),
            TermsDetailModel(
                titleString: "개인정보수집/이용 동의",
                descriptionString: "서비스 제공 및 이용과 관련하여 오프로드가 취득한 개인정보는 “개인정보보호법” 및 “정보통신망 이용촉진 및 정보보호 등에 관한 법률” 등 정보통신서비스제공자가 준수하여야 할 관련 법령상의 개인정보 보호 규정을 준수합니다.",
                contentString: """
1. 고객이 수집 및 이용에 동의한 개인정보를 활용하여, 전자적 전송 매체(E-mail)를 통하여 발송됩니다.
2. 발송되는 마케팅 정보는 수신자에게 오프로드 및 제 3자의 상품 또는 서비스에 대한 혜택 정보, 각종 이벤트 정보, 개인 맞춤형 광고 정보 등 광고성 정보로 관련 법의 규정을 준수하여 발송됩니다. 단, 광고성 정보 이외에 의무적으로 안내되어야 하는 정보성 내용은 수신동의 여부와 무관하게 제공됩니다.
3. 마케팅 정보 수신 여부 및 마케팅을 위한 개인정보 수집이용을 거부하실 수 있으며, 거부 시에도 Track 1 서비스를 이용하실 수 있으나, 동의를 거부한 경우 각종 소식 및 이벤트 참여에 제한이 있을 수 있습니다.
4. 수신동의를 받은 날부터 2년마다 (매 2년이 되는 해의 수신동의를 받은 날과 같은 날 전까지를 말한다.) 해당 수신자의 수신동의 여부를 확인합니다.
5. Track 1 고객센터를 통해 수신동의를 철회할 수 있습니다.
※ 문의 및 동의 철회: dlrmsdnjs555@naver.com
 ∙ 개인정보 수집항목: 이메일, 닉네임
 ∙ 개인정보 수집 이용 목적: 이벤트 운영 및 광고성 정보 전송, 서비스 관련 정보 전송
 ∙ 보유 및 이용기간: 이용자가 동의를 철회하거나, 탈퇴 시까지(마케팅 수신동의 여부 2년 주기로 확인). 단, 관련 법령 규정에 따라 보존할 필요가 있을 경우, 해당 기간까지 보존함.
"""
            ),
            TermsDetailModel(
                titleString: "위치기반 서비스 이용약관",
                descriptionString: "서비스 제공 및 이용과 관련하여 오프로드가 취득한 개인정보는 “개인정보보호법” 및 “정보통신망 이용촉진 및 정보보호 등에 관한 법률” 등 정보통신서비스제공자가 준수하여야 할 관련 법령상의 개인정보 보호 규정을 준수합니다.",
                contentString: """
1. 고객이 수집 및 이용에 동의한 개인정보를 활용하여, 전자적 전송 매체(E-mail)를 통하여 발송됩니다.
2. 발송되는 마케팅 정보는 수신자에게 오프로드 및 제 3자의 상품 또는 서비스에 대한 혜택 정보, 각종 이벤트 정보, 개인 맞춤형 광고 정보 등 광고성 정보로 관련 법의 규정을 준수하여 발송됩니다. 단, 광고성 정보 이외에 의무적으로 안내되어야 하는 정보성 내용은 수신동의 여부와 무관하게 제공됩니다.
3. 마케팅 정보 수신 여부 및 마케팅을 위한 개인정보 수집이용을 거부하실 수 있으며, 거부 시에도 Track 1 서비스를 이용하실 수 있으나, 동의를 거부한 경우 각종 소식 및 이벤트 참여에 제한이 있을 수 있습니다.
4. 수신동의를 받은 날부터 2년마다 (매 2년이 되는 해의 수신동의를 받은 날과 같은 날 전까지를 말한다.) 해당 수신자의 수신동의 여부를 확인합니다.
5. Track 1 고객센터를 통해 수신동의를 철회할 수 있습니다.
※ 문의 및 동의 철회: dlrmsdnjs555@naver.com
∙ 개인정보 수집항목: 이메일, 닉네임
∙ 개인정보 수집 이용 목적: 이벤트 운영 및 광고성 정보 전송, 서비스 관련 정보 전송
∙ 보유 및 이용기간: 이용자가 동의를 철회하거나, 탈퇴 시까지(마케팅 수신동의 여부 2년 주기로 확인). 단, 관련 법령 규정에 따라 보존할 필요가 있을 경우, 해당 기간까지 보존함.
"""
            ),
            TermsDetailModel(
                titleString: "마케팅 정보 수신 동의",
                descriptionString: "서비스 제공 및 이용과 관련하여 오프로드가 취득한 개인정보는 “개인정보보호법” 및 “정보통신망 이용촉진 및 정보보호 등에 관한 법률” 등 정보통신서비스제공자가 준수하여야 할 관련 법령상의 개인정보 보호 규정을 준수합니다.",
                contentString: """
1. 고객이 수집 및 이용에 동의한 개인정보를 활용하여, 전자적 전송 매체(E-mail)를 통하여 발송됩니다.
2. 발송되는 마케팅 정보는 수신자에게 오프로드 및 제 3자의 상품 또는 서비스에 대한 혜택 정보, 각종 이벤트 정보, 개인 맞춤형 광고 정보 등 광고성 정보로 관련 법의 규정을 준수하여 발송됩니다. 단, 광고성 정보 이외에 의무적으로 안내되어야 하는 정보성 내용은 수신동의 여부와 무관하게 제공됩니다.
3. 마케팅 정보 수신 여부 및 마케팅을 위한 개인정보 수집이용을 거부하실 수 있으며, 거부 시에도 Track 1 서비스를 이용하실 수 있으나, 동의를 거부한 경우 각종 소식 및 이벤트 참여에 제한이 있을 수 있습니다.
4. 수신동의를 받은 날부터 2년마다 (매 2년이 되는 해의 수신동의를 받은 날과 같은 날 전까지를 말한다.) 해당 수신자의 수신동의 여부를 확인합니다.
5. Track 1 고객센터를 통해 수신동의를 철회할 수 있습니다.
※ 문의 및 동의 철회: dlrmsdnjs555@naver.com
∙ 개인정보 수집항목: 이메일, 닉네임
∙ 개인정보 수집 이용 목적: 이벤트 운영 및 광고성 정보 전송, 서비스 관련 정보 전송
∙ 보유 및 이용기간: 이용자가 동의를 철회하거나, 탈퇴 시까지(마케팅 수신동의 여부 2년 주기로 확인). 단, 관련 법령 규정에 따라 보존할 필요가 있을 경우, 해당 기간까지 보존함.
"""
            )
        ]
    }
}
